{
    "performances": [
        {
        "performanceName": "episode 110" ,
        "shortName": "Love_Ya_to_Death",
        "tracklist": [" Love Ya to Death"],
        "summary": "'Love Ya to Death' was performed by Dr. Teeth and the Electric Mayhem in The Muppet Show: Sex and Violence (where it was also used as the instrumental opening and closing theme) and in The Muppet Show episode 110. Prior to the debut of the special, Dr. Teeth (in his first televised appearance) performed the song on The Tonight Show on March 18, 1975.",
        "artwork": "/images/muppet-Show/Love_Ya_to_Death.webp",
        "albumListen":"NrD7lTSyKqQ",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 102" ,
        "shortName":"Aint_Misbehavin",
        "tracklist": ["Ain't Misbehavin"],
        "summary": "'Ain't Misbehavin', from the musical Connie's Hot Chocolates, has been performed by many artists over the years, perhaps most famously by co-writer Fats Waller for the 1943 film Stormy Weather. The song was used as the opening number in the popular 1978 Broadway musical of the same name, which starred Nell Carter.Floyd Pepper, backed by Janice and Zoot, sings 'Ain't Misbehavin' as the UK Spot in episode 102 of The Muppet Show. Although this marks Floyd's first appearance on The Muppet Show, this segment was taped later than the rest of the episode, as evidenced by the fact that he was performed by an uncredited Jerry Nelson, who was not available to tape the first several episodes of the series.",
        "artwork": "/images/muppet-Show/Aint_Misbehavin.webp",
        "albumListen":"tHIdXsFSKws",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 104" ,
        "shortName":"Sunny",
        "tracklist": ["Sunny"],
        "summary": "The Electric Mayhem sings 'Sunny' in Episode 104 of The Muppet Show. As Floyd performs lead vocals, Animal continues to scream for a faster tempo, and increases the speed of his drumming. The band keeps up, though Floyd becomes a bit flustered while singing. The song gets so fast that the band becomes frantic and finally passes out on stage, except for Animal of course.The song was also sung in the Sesame Street Live show, Elmo's Green Thumb as a tribute to Elmo's sunflower.",
        "artwork": "/images/muppet-Show/Sunny.webp",
        "albumListen":"smANBMgPcuE",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 106" ,
        "shortName":"Money",
        "tracklist": ["Money"],
        "summary": "'Money' is a comedy song by Stan Freberg and Ruby Raskin that was performed by Jim Henson and the Muppets on Sam and Friends, in variety show appearances and on The Muppet Show.On Sam and Friends, Henson's earliest television program, the Muppet characters lip-synched to a Mel Blanc recording of 'Money'. Henson began performing the song for variety-show appearances in the mid-60s, including on The Mike Douglas Show and The Tonight Show in 1966. In these sketches, the Muppet character (either Tommy or Rowlf the Dog) would grab various props, including a wallet, a piggy bank, and a bank bag.",
        "artwork": "/images/muppet-Show/Money.webp",
        "albumListen":"x9J0mo19mbM",
        "featuredArtists": ["none"]


    },
    {
        "performanceName": "episode 116" ,
        "shortName":"Tenderly",
        "tracklist": ["Tenderly"],
        "summary": "'Tenderly' is performed by Dr. Teeth and the Electric Mayhem on The Muppet Show episode 116. The sweet song is performed to a loud, driving rock beat. Dr. Teeth also performed the song with Mike Douglas in a 1976 appearance on The Mike Douglas Show. An instrumental version of The Muppet Show version is used as background music throughout the home video Rock Music with the Muppets.",
        "artwork": "/images/muppet-Show/Tenderly.webp",
        "albumListen":"nGXd4ekmp1w",
        "featuredArtists": ["none"]
        
        
    },
    {
        "performanceName": "episode 118" ,
        "shortName":"Lazybones",
        "tracklist": ["Lazybones"],
        "summary": "'Lazy Bones' is a classic Tin Pan Alley song which has become a jazz standard, and been recorded by many artists including Louis Armstrong, Hoagy Carmichael, and Harry Connick, Jr. It was performed by Dr. Teeth and the Electric Mayhem (sans Animal), for the UK Spot in episode 118 of The Muppet Show. Dr. Teeth sings lead.",
        "artwork": "/images/muppet-Show/Lazybones.webp",
        "albumListen":"mvpszNNiO3A",
        "featuredArtists": ["none"]
        
        
    },
    {
        "performanceName": "episode 120" ,
        "shortName":"Searchin",
        "tracklist": ["Searchin"],
        "summary": "'Searchin' is about a man who, likening himself to famous detectives like Charlie Chan and Dragnet's Sergeant Friday, is looking for the girl of his dreams. It was a top ten hit for the Coasters as the B-side of their 'Youngblood' single, and was later covered by the Beatles. Floyd Pepper performed 'Searchin' on episode 120 of The Muppet Show as he scoured a forest for an elusive Mary Louise, who, dressed in a yellow toga with a wreath of flowers on her head, always seemed to pop up behind Floyd when he was looking in the other direction. He was aided in his pursuit by two Whatnot detectives, one green and one blue, who wore trenchcoats and sported goatees and red pupils. Both Whatnots were performed simultaneously by Jim Henson, a la the Snowths.",
        "artwork": "/images/muppet-Show/Searchin.webp",
        "albumListen":"Yj4KENme7hQ",
        "featuredArtists": ["none"]
        
        
    },
    {
    "performanceName": "episode 123" ,
    "shortName":"Fugue_for_Frog",
    "tracklist": ["Fugue for Frog"],
    "summary": "'Fugue for Frog' is a suggested new theme song for The Muppet Show, performed by The Muppet Orchestra backstage in episode 123. Floyd Pepper and the rest of the Electric Mayhem threaten to leave the show because of the square theme song. Kermit allows Floyd to write a new theme song of his own. Later, Floyd presents his new composition for Kermit backstage as 'Fugue for Frog'. Kermit says he likes the title, but Floyd warns him beforehand, saying he 'will hate the rest.' Quite so; after having heard the piece, Kermit shouts out, 'That was the worst!' Musically, the piece appears to be a parody of Frank Zappa's most ambitious and exclusive style.",
    "artwork": "/images/muppet-Show/Fugue_for_Frog.webp",
    "albumListen":"wXaaqb8aja8",
    "featuredArtists": ["none"]


},
        {
        "performanceName": "episode 124",
        "shortName":"Mr_Bassman",
        "tracklist": ["Mr. Bassman"],
        "summary": "'Mr. Bassman' is sung by Floyd Pepper and Scooter, and backed by Dr. Teeth and the Electric Mayhem, on episode 124 of The Muppet Show. Jerry Nelson uses a deeper voice for Floyd on this song, perhaps to accentuate the vocal bass parts. Floyd uses a similar voice to perform 'Ain't Misbehavin'.",
        "artwork": "/images/muppet-Show/Mr_Bassman.webp",
        "albumListen":"SnieQ7hUcN8",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 202" ,
        "shortName":"Chopins_Polonaise_In_A_Flat",
        "tracklist": ["Chopins Polonaise in A Flat"],
        "summary": "'Polonaise in A-flat major' is the 53rd opus by Polish composer Frédéric Chopin. A rock version of the piece was performed by The Electric Mayhem in The Muppet Show episode 202 when the concert pianist couldn't make it. While Sam the Eagle weeps in frustration, Kermit observes, 'Good ol' Chopin. You can't beat the classics. You can only destroy 'em.' On Sesame Street, a more traditional version was performed by Slimey in Episode 1614. Oscar is discouraged by Slimey's flawless playing and recommends a more Grouch-appropriate encore.",
        "artwork": "/images/muppet-Show/Chopins_Polonaise_In_A_Flat.webp",
        "albumListen":"https://www.youtube.com/watch?v=FdQUKeHuymA",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 209" ,
        "shortName":"New_York_State_of_Mind",
        "tracklist": ["New York State of Mind"],
        "summary": "'New York State of Mind' was written and originally performed by Billy Joel; it has since been covered by many artists, including Tony Bennett and Barbra Streisand.The song was performed by Floyd Pepper as the UK Spot in episode 209 of The Muppet Show. He was backed by Dr. Teeth on piano and Zoot on saxophone. The clip was later used as a main segment of episode 301. They sang it again on The Tonight Show, when Kermit the Frog guest hosted while Johnny Carson was away (lip-syncing to The Muppet Show recording). Rowlf the Dog performed a version on the album Ol' Brown Ears is Back.",
        "artwork": "/images/muppet-Show/New_York_State_of_Mind.webp",
        "albumListen":"i06cGfI3psM",
        "featuredArtists": ["none"]


    },


        {
        "performanceName": "episode 211" ,
        "shortName":"Dont_Blame_The_Dynamite",
        "tracklist": ["Don't Blame The Dynamite"],
        "summary": "Dr. Teeth and the Electric Mayhem perform the original number 'Don't Blame the Dynamite' in The Muppet Show episode 211. Dr. Teeth, Floyd Pepper, and Janice all provide vocals.",
        "artwork": "/images/muppet-Show/Dont_Blame_The_Dynamite.webp",
        "albumListen":"NLVigHZ27_E",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 213" ,
        "shortName":"Minuet_in_A_Major",
        "tracklist": ["Minuet in A Major"],
        "summary": "The Minuet in A Major comes from Luigi Boccherini's String Quintet in E, Op. 11, No. 5. Arrangements for four or five players are available. It is considered the composer's most popular work. The Electric Mayhem attempts to perform a semi-traditional version of the 'Minuet in A Major' as the opening number in episode 213 of The Muppet Show. Unfortunately for certain culture lovers, the musicians are audibly discontented with the commission of playing classical music on their rock instruments. Once Animal reaches a breaking point and starts drumming wildly, the band completely lets go of any attempt at traditionalism and finishes the song to a rock and roll beat.",
        "artwork": "/images/muppet-Show/Minuet_in_A_Major.webp",
        "albumListen":"_yC-Qd_nq30",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 222" ,
        "shortName":"Cheese_Cake",
        "tracklist": ["Cheese Cake"],
        "summary": "'Cheese Cake' is a classic Louis Armstrong tune which was used for the UK Spot in episode 222 of The Muppet Show. Dr. Teeth plays an upright piano (rather than his trademark keyboard) with Miss Kitty, two Frackles, and Beautiful Day Monster singing backup. Miss Piggy shows up at the end (defying her diet) to chase after the cheesecake.",
        "artwork": "/images/muppet-Show/Cheese_Cake.webp",
        "albumListen":"2RD0S3JNa_Y",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 222" ,
        "shortName":"Wild_Thing",
        "tracklist": ["Wild Thing"],
        "summary": "'Wild Thing' is a hit song written by New York-born songwriter Chip Taylor and originally recorded by the Wild Ones in 1965. The song is probably best known for its 1966 cover by the English band The Troggs, leading many to assume they are the original artist; however, the Troggs' version is only one of several covers.Animal sang 'Wild Thing' in episode 222 of The Muppet Show, accompanying himself with a raucous drum beat. At the end of the number, Animal is dragged away by Janice and a pig with nets.Kermit, Floyd, and Animal later performed the song on the 1994 album Kermit Unpigged. Kermit is hoping to play a nice, quiet, unplugged version on his ukulele -- 'Wild thing, dee-dum, ding, dum'—but Animal insists on plugging in. After the exuberant performance, Floyd takes a worn out Animal away for 'num-nums and a nap.'",
        "artwork": "/images/muppet-Show/Wild_Thing.webp",
        "albumListen":"YS8KhXYM",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 314" ,
        "shortName":"Honeysuckle_Rose",
        "tracklist": ["Honeysuckle Rose"],
        "summary": "'Honeysuckle Rose' is a song composed by Fats Waller which has become a jazz standard recorded by many artists and bands, including Waller, Benny Goodman, Louis Armstrong and Lena Horne. Floyd Pepper and Zoot perform an instrumental version of it as the UK Spot on episode 314 of The Muppet Show. During the performance, a bee bothers Zoot and gets into his saxophone. Zoot eventually swallows the bee, and then spits it back out.",
        "artwork": "/images/muppet-Show/Honeysuckle_Rose.webp",
        "albumListen":"JcnFSAijzLQ",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 314" ,
        "shortName":"Mack_the_Knife",
        "tracklist": ["Mack the Knife"],
        "summary": "'Mack the Knife' was originally written in German as 'Die Moritat von Mackie Messer' for the musical Die Dreigroschenoper, or The Threepenny Opera, but has since been translated into English several times; the best-known translation is by Marc Blitzstein. The song is considered a swing standard and was first recorded in 1954, by Louis Armstrong. The most successful version on the American charts was by Bobby Darin in 1959. In 1960, Ella Fitzgerald won a Grammy for a live version of the song in which she ad-libbed the verses after forgetting the lyrics. Dr. Teeth performed 'Mack the Knife' as the UK Spot on episode 315 of The Muppet Show. Sam the Eagle, who was appalled at the song's grisly lyrics, had to be persuaded that the lyrics, which in truth are quite literal, were metaphors for more pleasant things.",
       
        "artwork": "/images/muppet-Show/Mack_the_Knife.webp",
        "albumListen":"MpSGtT_s7XA",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 317" ,
        "shortName":"America",
        "tracklist": ["America"],
        "summary": "'America', from Leonard Bernstein and Stephen Sondheim's musical West Side Story, is a song about Puerto Rican immigrants living in New York City who extol the virtues of their new homeland. In the stage version of the musical, the lone dissenter is one of the Puerto Rican women, but in the film version, it is the men who want to go back to San Juan. Rita Moreno leads the number in the film, for which she won an Academy Award in the role of Anita.The Electric Mayhem performs the song on a set decorated with traditional American stars and stripes in episode 317 of The Muppet Show. The song turns into a global jam session when the international Muppet guests join in.The international Muppets include the Witch Doctor representing a tribal nation, a Mexican Whatnot playing the trumpet ('Jarabe Tapatío,' better known as 'The Mexican Hat Dance'), two Russian pig soldiers playing balalaikas, Mahna Mahna dancing for a Polynesian tribe, a Scotsman playing the bagpipe ('Hava Nagila'), and the Swedish Chef playing the concertina for Mary Louise and a goat ('See Me Dance the Polka').",
        "artwork": "/images/muppet-Show/America.webp",
        "albumListen":"_hr-kModYtY",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 320" ,
        "shortName":"Lady_Be_Good",
        "tracklist": ["Lady Be Good"],
        "summary": "'Lady Be Good,' frequently referred to as 'Oh Lady Be Good,' is a jazz standard from George and Ira Gershwin's Broadway musical of the same name.Dr. Teeth and the Electric Mayhem performed 'Lady Be Good' as the UK Spot on episode 320 of The Muppet Show.",
        "artwork": "/images/muppet-Show/Lady_Be_Good.webp",
        "albumListen":"HEjjiNChf1Q",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 418" ,
        "shortName":"Sams_Song",
        "tracklist": ["Sam's Song"],
        "summary": "Floyd and Janice sing 'Sam's Song' for the UK Spot on episode 418 of The Muppet Show. They are trying to annoy Sam the Eagle, who is busy writing a letter to put a stop to all the weirdness. Beauregard joins them on harmonica, Nigel whistles, and Rizzo dances.A recording of the song by Vicki Bennett was previously used on Sam and Friends in 1957.",
        "artwork": "/images/muppet-Show/Sams_Song.webp",
        "albumListen":"bXgQscLONDU",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 419" ,
        "shortName":"With_A_Little_Help_From_My_Friends",
        "tracklist": ["With a Little Help From My Friends"],
        "summary": "With a Little Help from My Friends is a Beatles song performed by Janice, some pagan pigs and their Sacrificial Idol in episode 419 of The Muppet Show. Janice ultimately gets rescued by Dr. Teeth, Animal, Floyd and Zoot at the end of the number. Previously, on an Ed Sullivan Show performance from January 17, 1971, Mahna Mahna briefly sings a bit of the chorus, also playing his drums, while The String Quartet performs.Joe Cocker's cover of the song was spoofed on Sesame Street as 'With a Little Yelp from My Friends.'The Electric Mayhem later performed the song, specifically the Joe Cocker arrangement, during their appearance at the 2016 Outside Lands Music and Arts Festival along with backup from Oakland's Interfaith Gospel Choir. The same arrangement was used as the encore for both The Muppets Take the Bowl (joined by Fred Martin and the Levite Camp Choir) and The Muppets Take the O2.",
        "artwork": "/images/muppet-Show/With_A_Little_Help_From_My_Friends.webp",
        "albumListen":"hhZwt2UfBAE",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 419" ,
        "shortName":"While_My_Guitar_Gently_Weeps",
        "tracklist": ["While My Guitar Gently Weeps"],
        "summary": "'While My Guitar Gently Weeps' was a Beatles song written by George Harrison that appeared on their album The Beatles (also known as the White Album).The song was performed by Floyd Pepper in episode 419 of The Muppet Show.A reference to this song was made in The Street We Live On. During the opening sequence, Grover observes Rosita playing her guitar, saying that she certainly can make that guitar weep. Rosita responds 'Gracias... I think.'",
        "artwork": "/images/muppet-Show/While_My_Guitar_Gently_Weeps.webp",
        "albumListen":"nr7v5lLQhHQ",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 503" ,
        "shortName":"Blackbird",
        "tracklist": ["Blackbird"],
        "summary": "'Blackbird' is a song first recorded by the Beatles, and subsequently covered by many artists. In the original recording it features acoustic guitar and a recording of a blackbird's song. It was sung by Floyd Pepper and Janice as the UK Spot in episode 503 of The Muppet Show.",
        "artwork": "/images/muppet-Show/Blackbird.webp",
        "albumListen":"1bvSzOX27Mc",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 504" ,
        "shortName":"Barnyard_Boogie",
        "tracklist": ["Barnyard Boogie"],
        "summary": "'Barnyard Boogie' was performed by Dr. Teeth and the Electric Mayhem at a barn in The Muppet Show episode 504. The band was joined by many barnyard animals, including Gaffer, Rizzo the Rat, T.R., the chickens, a pig, a sheep, a cow, a duck and a dog.This song features a rare vocal performance by Lips.",
        "artwork": "/images/muppet-Show/Barnyard_Boogie.webp",
        "albumListen":"0ZI8xgMiVyY",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 504" ,
        "shortName":"After_Youve_Gone",
        "tracklist": ["After You've Gone"],
        "summary": "'After You've Gone,' is a jazz standard that has been recorded by a variety of artists, including Louis Armstrong, Benny Goodman, Charlie Parker, and Frank Sinatra. It was sung by Judy Garland in the 1942 movie For Me and My Gal.An instrumental version of 'After You've Gone' is performed as the UK Spot in episode 504 of The Muppet Show. It features Nigel conducting Floyd, Zoot, Janice (on banjo), Animal, Rowlf, Lips, and the Trumpet Girl (on trombone) in the orchestra pit.The number is performed similarly to 'How High the Moon' in episode 524. Both are instrumentals performed as UK Spots by the orchestra in the pit, and the shots of the individual musicians follow the same order.",
        "artwork": "/images/muppet-Show/After_Youve_Gone.webp",
        "albumListen":"uhN78FUq6Fo",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 510" ,
        "shortName":"Rockin_Robin",
        "tracklist": ["Rockin' Robin"],
        "summary": "'Rockin' Robin' is performed by Dr. Teeth and the Electric Mayhem in The Muppet Show episode 510.This is one of the two Electric Mayhem songs where Janice sang lead vocals; the other is 'With a Little Help from My Friends'.The band performs in a tree, joined by a few birds, including the Rockin' Robin, who was performed by Karen Prell. Animal soloed the enthusiastic line 'Tweet, tweet, tweet!'This version of the song appears on the videos Rock Music with the Muppets (1985) and 'It's the Muppets: More Muppets, Please!' (1993).",
        "artwork": "/images/muppet-Show/Rockin_Robin.webp",
        "albumListen":"GWfnlj312ek",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 511" ,
        "shortName":"50_Ways_to_Leave_Your_Lover",
        "tracklist": ["50 Ways to Leave Your Lover"],
        "summary": "'50 Ways to Leave Your Lover' is a song written and recorded by Paul Simon, and included on Simon's album Still Crazy After All These Years. Released in December 1975, the song—about a promiscuous woman's humorous advice to a man wanting to leave his wife—became a major pop hit, spending three weeks at No. 1 on the Billboard Hot 100 in early 1976. On The Muppet Show, '50 Ways ... ' was sung by Floyd and Janice in episode 511. They were backed by Animal on drums and Rizzo the Rat on cymbals.",
        "artwork": "/images/muppet-Show/50_Ways_to_Leave_Your_Lover.webp",
        "albumListen":"-xbnE-i2bfQ",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 513" ,
        "shortName":"Poison_Ivy",
        "tracklist": ["Poison Ivy"],
        "summary": "Poison Ivy was a #7 hit for the Coasters in 1959, and has been covered by groups as diverse as Hanson and The Electric Mayhem (in The Muppet Show episode 513).",
        "artwork": "/images/muppet-Show/Poison_Ivy.webp",
        "albumListen":"daFhWigM8PI",
        "featuredArtists": ["none"]


    },
        {
        "performanceName": "episode 524" ,
        "shortName":"How_High_The_Moon",
        "tracklist": ["How High The Moon"],
        "summary": "'How High the Moon,' the jazz standard by Morgan Lewis and Nancy Hamilton, is considered to be one of Ella Fitzgerald's signature songs. A 1951 recording by Les Paul and Mary Ford reached #1 on the Billboard charts. The Muppets have performed it several times.",
        "artwork": "/images/muppet-Show/How_High_The_Moon.webp",
        "albumListen":"cXxQUN2z2-M",
        "featuredArtists": ["none"]


    }
       



]
    
    
}