{
    "soundtracks": [
        {
        "albumName": "The Muppet Movie" ,
        "shortName": "The_Muppet_Movie",
        "tracklist":["Can You Picture That?"],
        "summary": "The Muppet Movie is a musical road comedy film directed by James Frawley, produced by Jim Henson, and the first theatrical film featuring the Muppets. A co-production between the United Kingdom and the United States, the film was written by The Muppet Show writers Jerry Juhl and Jack Burns. Produced between the first and second half of The Muppet Show's third season, the film tells the origin story of the Muppets, as Kermit the Frog embarks on a cross-country trip to Los Angeles, encountering several of the Muppets—who all share the same ambition of finding success in professional show business—along the way while being pursued by Doc Hopper, a greedy restaurateur with intentions of employing Kermit as a spokesperson for his frog legs business.",
        "artwork":"/images/soundtracks/The_Muppet_Movie_soundtrack.jpg" ,
        "albumListen":"HNNwzMjr4ww",
        "featuredArtists": [""]

    },
        {
        "albumName": "The Great Muppet Caper" ,
        "shortName": "The_Great_Muppet_Caper",
        "tracklist": ["Night Life"],
        "summary": "The Great Muppet Caper is a 1981 musical heist comedy film directed by Jim Henson (in his feature directorial debut). It is the second theatrical film in The Muppets franchise. In addition to the Muppet performers, the film stars Charles Grodin and Diana Rigg with special appearances by John Cleese, Robert Morley, Peter Ustinov, and Jack Warden. The film was produced by ITC Entertainment and The Jim Henson Company and distributed by Universal Pictures. In the plot, the Muppets are caught up in a jewel heist while investigating a robbery in London.The film was released by Universal Pictures and Associated Film Distribution on 26 June 1981 in the United States and on 30 July 1981 in the United Kingdom. It is the only Muppets feature film directed by Henson. Shot in the United Kingdom and London in 1980, the film was released shortly after the final season of The Muppet Show.",
        "artwork": "/images/soundtracks/The_Great_Muppet_Caper.jpg",
        "albumListen":"RSRXuA-2qd8",
        "featuredArtists": [""]

    },
        {
        "albumName": "The Muppets Take Manhattan" ,
        "shortName": "The_Muppets_Take_Manhattan",
        "tracklist": ["You Can't Take No For An Answer "],
        "summary": "The Muppets Take Manhattan is a 1984 American musical comedy-drama film directed by Frank Oz. It is the third theatrical film in The Muppets franchise. In addition to the Muppet performance, the film features special appearances by Art Carney, James Coco, Dabney Coleman, Gregory Hines, Linda Lavin and Joan Rivers. Filmed in New York City during the prior summer, it was released theatrically on July 13, 1984, by TriStar Pictures. A fantasy sequence in the film introduced the Muppet Babies, toddler versions of the lead Muppet characters.Muppets Take Manhattan was the first film to be directed solely by Oz, who previously co-directed The Dark Crystal with Jim Henson.",
        "artwork": "/images/soundtracks/The_Muppets_Take_Manhattan.jpg",
        "albumListen":"seLaJwCXR8Y",
        "featuredArtists": [""]

    },
        {
        "albumName": "The Muppet Christmas Carol" ,
        "shortName": "The_Muppet_Christmas_Carol",
        "tracklist": ["Fozziwig's Party"],
        "summary": "The Muppet Christmas Carol is a 1992 American Christmas musical comedy drama film directed by Brian Henson (in his feature directorial debut) from a screenplay by Jerry Juhl. Adapted from the 1843 novella A Christmas Carol by Charles Dickens, it stars Michael Caine as Ebenezer Scrooge, alongside Muppet performers Dave Goelz, Steve Whitmire, Jerry Nelson, and Frank Oz. Although artistic license is taken to suit the aesthetic of the Muppets, The Muppet Christmas Carol otherwise follows Dickens's original story closely.[5] It is the fourth theatrical film in The Muppets franchise, and the first to be produced following the deaths of Muppets creator Jim Henson and performer Richard Hunt; the film is dedicated to both. The film was released in the United States on December 11, 1992, by Buena Vista Pictures Distribution. It was a modest box office success and received mostly positive reviews. It is the first Muppets film to be produced by Walt Disney Pictures, whose parent company would later acquire the rights to the Muppets characters and assets in 2004.",
        "artwork": "/images/soundtracks/The_Muppet_Christmas_Carol.jpg",
        "albumListen":"paSUlf4rCpA",
        "featuredArtists": [""]

    },
        {
        "albumName": "The Muppets' Wizard of Oz" ,
        "shortName": "The_Muppets_Wizard_of_Oz",
        "tracklist": [ "Tenderly",  "Nap Time",  "The Witch is in the House"],
        "summary": "The Muppets' Wizard of Oz is a 2005 musical fantasy television film directed by Kirk R. Thatcher. It is the second film to be made for television in The Muppets franchise. The film stars Ashanti, Jeffrey Tambor, Quentin Tarantino, David Alan Grier, Queen Latifah, Steve Whitmire, Dave Goelz, Bill Barretta, and Eric Jacobson. A contemporary adaptation of the 1900 novel The Wonderful Wizard of Oz by L. Frank Baum, the story follows young Dorothy Gale, who works in her Aunt Em's diner, but dreams of becoming a singer somewhere beyond her small Kansas town. Swept up by a tornado, in her trailer home with pet prawn Toto, she lands in Oz and embarks on a journey to meet the Wizard who can help make her dreams come true. Right after The Walt Disney Company bought the rights to the Muppets franchise in 2004, pre-production took place throughout February 2004, and principal photography began seven months later. ABC made several changes after the initial script was written, ultimately deciding to adapt plot elements from Baum's original novel rather than the 1939 Metro-Goldwyn-Mayer Pictures musical film The Wizard of Oz (since the original 1939 film is currently owned by Warner Bros. Discovery). The Muppets' Wizard of Oz became a musical, and included five new songs written and composed by Michael Giacchino. It is the first Muppets film without the involvement of veteran performer Jerry Nelson following his 2004 retirement from physical performing. His characters of Lew Zealand and Floyd Pepper were respectively performed by Bill Barretta and John Kennedy. Barretta also debuts as the new permanent performer of Dr. Teeth, a character originally performed by Jim Henson. The production also marked the feature film debut of Eric Jacobson as the performer of Sam Eagle, a character originally performed by Frank Oz.The Muppets' Wizard of Oz premiered on April 27, 2005, at the Tribeca Film Festival, and made its television premiere on ABC on May 20, 2005, as the final ABC Movie of the Week. The film received mixed to negative reviews from critics, who felt that the film was too mature for young audiences and that the cameos and popular culture references were unnecessary.",
        "artwork": "/images/soundtracks/The_Muppets_Wizard_of_Oz.png",
        "albumListen":"hQ6iq1a1_oU",
        "featuredArtists": ["Miss Piggy"]

    },
        {
        "albumName": "The Muppets" ,
        "shortName": "The_Muppets",
        "tracklist": ["Pictures in My Head", "Welcome Back"],
        "summary": "The Muppets is a 2011 American musical comedy film directed by James Bobin and written by Jason Segel and Nicholas Stoller, and the seventh theatrical film featuring the Muppets.[7] The film stars Jason Segel, Amy Adams, Chris Cooper, and Rashida Jones, as well as Muppets performers Steve Whitmire, Eric Jacobson, Dave Goelz, Bill Barretta, David Rudman, Matt Vogel, and Peter Linz. Bret McKenzie served as music supervisor, writing four of the film's five original songs, while Christophe Beck composed the film's score.[8] In the film, devoted Muppet fan Walter, his human brother Gary and Gary's girlfriend Mary help Kermit the Frog reunite the disbanded Muppets, as they must raise $10 million to save the Muppet Theater from Tex Richman, a businessman who plans to demolish the studio to drill for oil.Walt Disney Pictures first announced the film in March 2008, with Segel and Stoller as the screenwriters and Mandeville Films as co-producer.[2] Bobin was hired to direct in January 2010, and the film's supporting cast was filled out in October of the same year with the casting of Adams, Cooper and Jones. Filming began in September 2010 and was completed entirely in Los Angeles. The film was the first theatrical Muppets production to not feature Frank Oz and Jerry Nelson as their respective roles, though Nelson would make a voice cameo, thus making it his final Muppet film before his death the following year.[9][10] Instead, their characters are performed by Jacobson and Vogel, respectively, marking their theatrical feature film debut as those characters.The Muppets premiered at the Savannah Film Festival on November 4, 2011, and was released theatrically in North America on November 23, by Walt Disney Studios Motion Pictures.[11] The film was a critical and commercial success, grossing $165 million worldwide on a budget of $45 million and garnering praise for its humor, music, and revitalization of the characters. The film won the Academy Award for Best Original Song for McKenzie's song 'Man or Muppet', as well as garnering BAFTA and Critic's Choice Awards nominations. A sequel, titled Muppets Most Wanted, was released on March 21, 2014.",
        "artwork": "images/soundtracks/The_Muppets.jpg",
        "albumListen":"92XUv5Dz0dc",
        "featuredArtists": ["Kermit The Frog"]

    },
        {
        "albumName": "Muppets Haunted Mansion" ,
        "shortName": "Muppets_Haunted_Mansion",
        "tracklist": ["Dancing in The Moonlight"],
        "summary": "Muppets Haunted Mansion is a 2021 American puppet supernatural comedy Halloween special based on the Disney properties The Muppets and The Haunted Mansion. It was released on October 8, 2021, via Disney+. It is the Muppets' first Halloween special. The plot stars Gonzo and Pepe as they face the challenge of staying in a haunted mansion for one night. It received generally positive reviews from critics.",
        "artwork": "images/soundtracks/Muppets_Haunted_Mansion.png",
        "albumListen":"rW98ayfmvbs",
        "featuredArtists": [""]

    },
        {
        "albumName": "The Muppets Mayhem" ,
        "shortName": "The_Muppets_Mayhem",
        "tracklist": ["Rock on"],
        "summary": "The Muppets Mayhem is an upcoming comedy musical series based on the Muppet musical group, Dr. Teeth and the Electric Mayhem. The series was developed by Adam F. Goldberg, Bill Barretta, and Jeff Yorkes, for ABC Signature and The Muppets Studio. The series stars Lilly Singh, Tahj Mowry, Saara Chaudry, Anders Holm and Muppet performers Barretta, Peter Linz, Eric Jacobson, Matt Vogel, David Rudman, and Dave Goelz.The Muppets Mayhem is set to be released on May 10, 2023 on Disney+.",
        "artwork": "images/soundtracks/The_Muppets_Mayhem.jpg",
        "albumListen":"vn8zqHcCg5",
        "featuredArtists": [""]

    }
]
}